// Напиши скрипт створення та очищення колекції елементів.
// Користувач вводить кількість елементів в input і натискає кнопку Створити,
// після чого колекція рендерується.Коли натиснути кнопку Очистити, колекція елементів очищається.

// <div id="controls">
//   <input type="number" min="1" max="100" step="1" />
//   <button type="button" data-create>Create</button>
//   <button type="button" data-destroy>Destroy</button>
// </div>

// <div id="boxes"></div>
// Створи функцію createBoxes(amount), яка приймає один параметр – число.
// Функція створює стільки < div >, скільки вказано в amount і додає їх до div#boxes.

// Розміри першого <div> - 30px на 30px.
// Кожен елемент після першого повинен бути ширше і вище попереднього на 10px.
// Усі елементи повинні мати випадковий колір тла у форматі HEX.
// Використовуйте готову функцію getRandomHexColor для отримання кольору.
// function getRandomHexColor() {
//   return `#${Math.floor(Math.random() * 16777215)
//     .toString(16)
//     .padStart(6, 0)}`;
// }
// Створи функцію destroyBoxes(), яка очищає вміст div#boxes, тим самим видаляючи усі створені елементи.

// РІШЕННЯ:
